src/DataProcessors/ВыдачаТранзита/ВыдачаТранзита.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ВыдачаТранзита</name>
</mdclass:DataProcessor>

src/AccumulationRegisters/НеВыгруженноНаСайт/НеВыгруженноНаСайт.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>НеВыгруженноНаСайт</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Посылка</name>
    <type>
      <types>CatalogRef.Посылки</types>
    </type>
  </dimensions>
  <dimensions>
    <name>МестоХранения</name>
    <type>
      <types>CatalogRef.МестаХранения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Габарит</name>
    <type>
      <types>CatalogRef.Габариты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Коробка</name>
    <type>
      <types>CatalogRef.Коробки</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПунктВыдачи</name>
    <type>
      <types>CatalogRef.ТочкиРаздачи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Партия</name>
    <type>
      <types>DefinedType.ПартияДляОбмена</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

src/DataProcessors/ВыдачаТранзита/Forms/НеПодтвержденныеПосылки/Module.bsl
&НаКлиенте
Процедура Обновить(Команда)
	СтоСПОбмен_Посылки.ВыгрузитьНеВыгруженныеПосылки();
	ПолучитьНеПодтвержденныеПосылки();
КонецПроцедуры


Процедура ПолучитьНеПодтвержденныеПосылки()
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	НеВыгруженноНаСайтОстатки.Посылка КАК Посылка,
		|	НеВыгруженноНаСайтОстатки.МестоХранения КАК МестоХранения,
		|	НеВыгруженноНаСайтОстатки.Габарит КАК Габарит,
		|	НеВыгруженноНаСайтОстатки.Коробка КАК Коробка,
		|	НеВыгруженноНаСайтОстатки.Партия КАК Партия,
		|	НеВыгруженноНаСайтОстатки.КоличествоОстаток КАК Количество
		|ИЗ
		|	РегистрНакопления.НеВыгруженноНаСайт.Остатки(, ПунктВыдачи = &ПунктВыдачи) КАК НеВыгруженноНаСайтОстатки
		|
		|УПОРЯДОЧИТЬ ПО
		|	НеВыгруженноНаСайтОстатки.Партия.Дата";
	
	Запрос.УстановитьПараметр("ПунктВыдачи", ПунктВыдачи);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ЗагрузитьПосылки(РезультатЗапроса.Выгрузить());
	
КонецПроцедуры	



Процедура ЗагрузитьПосылки(ТЗ)
	ТЗ_рез = РеквизитФормыВЗначение("Посылки");
    МассивРеквизитов = Новый Массив;
    
    //Удалим ранее созданные колонки в ТЗ    
    Для Каждого Колонка Из ТЗ_рез.Колонки Цикл
        МассивРеквизитов.Добавить("Посылки." + Колонка.Имя);        
    КонецЦикла;
    ИзменитьРеквизиты(,МассивРеквизитов);	
	
	//Удалим отображение таблицы на форме и создадим новую
	ЭлементТаблица = Элементы.Найти("Посылки");
    Если ЭлементТаблица <> Неопределено Тогда
        Элементы.Удалить(ЭлементТаблица);        
	КонецЕсли;  
	
	
        ЭлементТаблица=Элементы.Добавить("Посылки",Тип("ТаблицаФормы"),Элементы.ГруппаПосылки);
        ЭлементТаблица.ПутьКДанным = "Посылки";
        ЭлементТаблица.Отображение = ОтображениеТаблицы.Список;
	
		
		
    //Создадим реквизиты ТЗ
    МассивРеквизитов.Очистить();
	
    Для Каждого Колонка ИЗ ТЗ.Колонки Цикл
        НоваяКолонка = Новый РеквизитФормы(Колонка.Имя, Колонка.ТипЗначения, "Посылки");
        МассивРеквизитов.Добавить(НоваяКолонка);
	КонецЦикла; 
    ИзменитьРеквизиты(МассивРеквизитов);  
   // ЗначениеВРеквизитФормы(ТЗ_рез, "ДанныеФайла");
	
    //Создаем элементы на форме для отображения колонок
    ЭлементТЗ = Элементы.Посылки;
    Для Каждого Колонка ИЗ ТЗ.Колонки Цикл
        НовыйЭлементФормы = Элементы.Добавить("Посылки"+Колонка.Имя, Тип("ПолеФормы"), ЭлементТЗ);
        НовыйЭлементФормы.Вид = ВидПоляФормы.ПолеВвода;
        НовыйЭлементФормы.ПутьКДанным = "Посылки." + Колонка.Имя;
    КонецЦикла;
        	
	Посылки.Загрузить(ТЗ);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	//ПунктВыдачи=Параметры.ПунктВыдачи;
	ПолучитьНеПодтвержденныеПосылки();
	Если Посылки.Количество() = 0 Тогда
		Оповестить(ИсточникВызова,ПунктВыдачи,ЭтаФорма);
		Закрыть(); 
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПродолжитьВЫбор(Команда)
	Оповестить("ВыдачаТранзита",ПунктВыдачи,ЭтаФорма);
	Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура Выгрузить(Команда)
	СтоСПОбмен_Посылки.ВыгрузитьНеВыгруженныеПосылки();
	ПолучитьНеПодтвержденныеПосылки();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ИсточникВызова  = Параметры.ИсточникВызова;
	ПунктВыдачи		= Параметры.ПунктВыдачи;
КонецПроцедуры
